
智慧纪检系统开发
1.上传所需文件等相关内容至服务器功能（可下载模板）。
2.智慧纪检信息管理页面开发，实现增删改查，PDF下载。、结算金额、填报呈批结果弹窗功能。
3.结算金额弹窗功能。
4.填报呈批结果弹窗功能。
5.详情弹窗功能。

智慧中台运行系统

1.根据需求创建对象（上台信息登记表，最好加一个审批记录表）
2.根据套装模板生一个页面和弹窗
3.配置弹窗页面，文件上传等
4.配置表格查询，根据角色判断，如果当前能力专员只能看到自己的，科室负责人能看到自己科室的，运营专员能看到所有的
5.新增一个审批页面，可以填写审批意见，上传图片（可能多张）
6.报表
7.对接新大陆相关人员，进行低代码培训，并指导以上需求配置。

协助地市
盐城：
文件上传
扬州：
手机网络问题 对象创建,规则设置,设置模糊匹配字段必填和显隐 
宿迁：
滤除敏感用户 实现excel文件解析 进行数据过滤
营业厅计件查询：协助实现页面挂载其他应用通过路由跳转至平台  携带用户信息进行数据的过滤
5G转化登录 新增复杂逻辑  (包含 目标用户已登记  该号码不是目标用户  目标用户已转化！ 新增成功 修改成功逻辑  )