var arr ={

    "dataList": [

        {

            "霍伟": "86.00",

            "尚桢": "80.00",

            "彭晓川": "null",

            "sumScore": "80.00",

            "id": "1",

            "郑明": "null",

            "部门名称": "市场经营部/乡村振兴办公室"

        },

        {

            "霍伟": "80.00",

            "尚桢": "80.00",

            "彭晓川": "80.00",

            "sumScore": "80.00",

            "id": "2",

            "郑明": "80.00",

            "部门名称": "政企事业部"

        },

        {

            "霍伟": "90.00",

            "尚桢": "90.00",

            "彭晓川": "90.00",

            "sumScore": "90.00",

            "id": "3",

            "郑明": "90.00",

            "部门名称": "智慧家庭运营部"

        },

        {

            "霍伟": "80.00",

            "尚桢": "80.00",

            "彭晓川": "80.00",

            "sumScore": "80.00",

            "id": "4",

            "郑明": "80.00",

            "部门名称": "重要客户中心"

        },

        {

            "霍伟": "100.00",

            "尚桢": "100.00",

            "彭晓川": "100.00",

            "sumScore": "null",

            "id": "5",

            "郑明": "100.00",

            "部门名称": "网络部"

        },

        {

            "霍伟": "80.00",

            "尚桢": "80.00",

            "彭晓川": "80.00",

            "sumScore": "80.00",

            "id": "6",

            "郑明": "80.00",

            "部门名称": "规划技术部"

        },

        {

            "霍伟": "90.00",

            "尚桢": "90.00",

            "彭晓川": "90.00",

            "sumScore": "90.00",

            "id": "7",

            "郑明": "90.00",

            "部门名称": "工程建设部"

        },

        {

            "霍伟": "80.00",

            "尚桢": "80.00",

            "彭晓川": "80.00",

            "sumScore": "80.00",

            "id": "8",

            "郑明": "80.00",

            "部门名称": "品质管理部"

        },

        {

            "霍伟": "80.00",

            "尚桢": "80.00",

            "彭晓川": "80.00",

            "sumScore": "80.00",

            "id": "9",

            "郑明": "80.00",

            "部门名称": "智数集成运营中心"

        },

        {

            "霍伟": "100.00",

            "尚桢": "100.00",

            "彭晓川": "100.00",

            "sumScore": "100.00",

            "id": "10",

            "郑明": "100.00",

            "部门名称": "网络运营中心"

        },

        {

            "霍伟": "80.00",

            "尚桢": "80.00",

            "彭晓川": "80.00",

            "sumScore": "80.00",

            "id": "11",

            "郑明": "80.00",

            "部门名称": "党委办公室（党委宣传部/党群工作部)"

        },

        {

            "霍伟": "80.00",

            "尚桢": "80.00",

            "彭晓川": "80.00",

            "sumScore": "80.00",

            "id": "12",

            "郑明": "80.00",

            "部门名称": "综合部（安保部)"

        },

        {

            "霍伟": "90.00",

            "尚桢": "90.00",

            "彭晓川": "90.00",

            "sumScore": "90.00",

            "id": "13",

            "郑明": "90.00",

            "部门名称": "财务部"

        },

        {

            "霍伟": "90.00",

            "尚桢": "90.00",

            "彭晓川": "90.00",

            "sumScore": "90.00",

            "id": "14",

            "郑明": "90.00",

            "部门名称": "内审部"

        },

        {

            "霍伟": "80.00",

            "尚桢": "80.00",

            "彭晓川": "80.00",

            "sumScore": "80.00",

            "id": "15",

            "郑明": "80.00",

            "部门名称": "人力资源部（党委组织部)"

        },

        {

            "霍伟": "80.00",

            "尚桢": "80.00",

            "彭晓川": "80.00",

            "sumScore": "80.00",

            "id": "16",

            "郑明": "80.00",

            "部门名称": "工会"

        },

        {

            "霍伟": "100.00",

            "尚桢": "100.00",

            "彭晓川": "100.00",

            "sumScore": "100.00",

            "id": "17",

            "郑明": "100.00",

            "部门名称": "纪委办公室（直属机关纪委)"

        },

        {

            "霍伟": "80.00",

            "尚桢": "80.00",

            "彭晓川": "80.00",

            "sumScore": "80.00",

            "id": "18",

            "郑明": "80.00",

            "部门名称": "党风廉政办公室（巡察工作办公室)"

        },

        {

            "霍伟": "80.00",

            "尚桢": "80.00",

            "彭晓川": "80.00",

            "sumScore": "80.00",

            "id": "19",

            "郑明": "80.00",

            "部门名称": "法律事务部"

        },

        {

            "霍伟": "80.00",

            "尚桢": "80.00",

            "彭晓川": "80.00",

            "sumScore": "80.00",

            "id": "20",

            "郑明": "80.00",

            "部门名称": "发展战略部"

        },

        {

            "霍伟": "90.00",

            "尚桢": "90.00",

            "彭晓川": "90.00",

            "sumScore": "90.00",

            "id": "21",

            "郑明": "90.00",

            "部门名称": "采购物流共享中心"

        },

        {

            "霍伟": "80.00",

            "尚桢": "80.00",

            "彭晓川": "80.00",

            "sumScore": "80.00",

            "id": "22",

            "郑明": "80.00",

            "部门名称": "信息安全中心"

        },

        {

            "霍伟": "100.00",

            "尚桢": "100.00",

            "彭晓川": "100.00",

            "sumScore": "100.00",

            "id": "23",

            "郑明": "100.00",

            "部门名称": "行政事务中心"

        }

    ]

}
// console.log('日志',arr);
var arr_p = ['霍伟','彭晓川','郑明','张小文','尚桢','魏红江','陈德永','李悦']
var arr_result = [];
var result = [];
const get_data = (params,arr)=>{
   var bool = true;
    arr.map(item=>{
        if(bool){
        if(item[params]){
            arr_result.push({key:params,value:true});
            bool=false
            }
            }
        })
    }


arr_p.map(item=>get_data(item,arr));
var obj = {};
console.log(arr_result);
arr_result.map(item=>{
if(item.key=="霍伟"){
    obj['p1'] = true;
    // result.push({p1:true})
}
if(item.key=="彭晓川"){
    obj['p2'] = true;
}
if(item.key=="郑明"){
    obj['p3'] = true;
}
if(item.key=="张小文"){
    obj['p4'] = true;
}
if(item.key=="尚桢"){
    obj['p5'] = true;
}
if(item.key=="魏红江"){
    obj['p6'] = true;
}
if(item.key=="陈德永"){
    obj['p7'] = true;
}
if(item.key=="李悦"){
    obj['p8'] = true;
}

})
 console.log('日志',obj)  
